## Case Study1:

To demonstrate operations on sample DataFrame

##### Import required libraries

In [1]:
import pandas as pd

In [2]:
# Create DataFrame

df = pd.DataFrame({'name':['Ashwin','Sanjay','Smita','Vaibhav','Abhijeet','Mahadev','Supriya','Pallavi','Sumeet','Chidambar','Subhash'],
                  'place':['Pune','Satara','Sangli','Solapur','Kolhapur','Pune','Satara','Sangli','Solapur','Pune','Satara'],
                  'age':[42,20,25,36,28,24,45,25,21,19,45]})
df

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
2       Smita    Sangli   25
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [3]:
# Get number of records in DataFrame

len(df)

11

Techniques to get coun of record

df.shape[0]

In [4]:
# Get list of all entries in any column

print(df.name.tolist())

['Ashwin', 'Sanjay', 'Smita', 'Vaibhav', 'Abhijeet', 'Mahadev', 'Supriya', 'Pallavi', 'Sumeet', 'Chidambar', 'Subhash']

In [5]:
# Get DataFrame in the format of dictionary

print(df.to_dict())

{'name': {0: 'Ashwin', 1: 'Sanjay', 2: 'Smita', 3: 'Vaibhav', 4: 'Abhijeet', 5: 'Mahadev', 6: 'Supriya', 7: 'Pallavi', 8: 'Sumeet', 9: 'Chidambar', 10: 'Subhash'}, 'place': {0: 'Pune', 1: 'Satara', 2: 'Sangli', 3: 'Solapur', 4: 'Kolhapur', 5: 'Pune', 6: 'Satara', 7: 'Sangli', 8: 'Solapur', 9: 'Pune', 10: 'Satara'}, 'age': {0: 42, 1: 20, 2: 25, 3: 36, 4: 28, 5: 24, 6: 45, 7: 25, 8: 21, 9: 19, 10: 45}}

It can be possible using

dict(df.name)

In [6]:
# Get single column as an array

df.name.values

array(['Ashwin', 'Sanjay', 'Smita', 'Vaibhav', 'Abhijeet', 'Mahadev',
       'Supriya', 'Pallavi', 'Sumeet', 'Chidambar', 'Subhash'],
      dtype=object)

In [7]:
# Get list of columns

df.columns

Index(['name', 'place', 'age'], dtype='object')

In [8]:
# Get first two records

df.head(2)

     name   place  age
0  Ashwin    Pune   42
1  Sanjay  Satara   20

It can be possible using slicing
df[:2]

In [9]:
# Get last two records

df.tail(2)

         name   place  age
9   Chidambar    Pune   19
10    Subhash  Satara   45

It can be possible using slicing
df[-2::]

In [10]:
# Get records where age is grater than 42

df[df.age>42]

       name   place  age
6   Supriya  Satara   45
10  Subhash  Satara   45

It can be possible using query

df.query('age>42')

In [11]:
# Get name of an emp who is from Kolhapur 

df[df.place=='Kolhapur']['name']

4    Abhijeet
Name: name, dtype: object

In [12]:
# Get count of Employee from unique places

df.place.value_counts()

Pune        3
Satara      3
Solapur     2
Sangli      2
Kolhapur    1
Name: place, dtype: int64

In [13]:
# List out unique places

df.place.unique()

array(['Pune', 'Satara', 'Sangli', 'Solapur', 'Kolhapur'], dtype=object)

In [14]:
# Get count of the unique places

df.place.nunique()

5

In [15]:
# Get records from pune location

df[df.place=='Pune']

        name place  age
0     Ashwin  Pune   42
5    Mahadev  Pune   24
9  Chidambar  Pune   19

In [16]:
# Get name of emp. whose age is min

df[df['age']==min(df.age)]

        name place  age
9  Chidambar  Pune   19

In [17]:
# Get record where length of employee name greater than five

df[df.name.map(lambda x:len(x)>6)]

         name     place  age
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
9   Chidambar      Pune   19
10    Subhash    Satara   45

Another way to get names

df[df.name.apply(len)>6]

In [18]:
# Get records of dataframe where name starts with 'S'

df[df.name.str.startswith('S')]

       name    place  age
1    Sanjay   Satara   20
2     Smita   Sangli   25
6   Supriya   Satara   45
8    Sumeet  Solapur   21
10  Subhash   Satara   45

In [19]:
# Get Records of dataframe where age is multiple of 4

df[df.age%4==0]

       name     place  age
1    Sanjay    Satara   20
3   Vaibhav   Solapur   36
4  Abhijeet  Kolhapur   28
5   Mahadev      Pune   24

In [20]:
# Replace pune by 1 and satara by 2 in dataframe

df.place.str.replace('Pune','1').replace('Satara','2')

0            1
1            2
2       Sangli
3      Solapur
4     Kolhapur
5            1
6            2
7       Sangli
8      Solapur
9            1
10           2
Name: place, dtype: object

It can be possible using map function, but it will insert NaN for remaining values and floating point 1 & 2. If all values will get replaced then they are in integer.

df.place.map({'Pune':1,'Satara':2}) 

This replacement can be possible using function

def sample(s):
    if s=='Pune':
        return 1
df.place.apply(sample)

In [21]:
# Get place of an employee whose name endswith 'a'

df[df.name.str.endswith('a')]['place']

2    Sangli
6    Satara
Name: place, dtype: object

In [22]:
# Get age of specific eployee

df[df.name=='Abhijeet']['age']

4    28
Name: age, dtype: int64

In [23]:
# Get records of an employees from place Satara

df[df.place=='Satara']

       name   place  age
1    Sanjay  Satara   20
6   Supriya  Satara   45
10  Subhash  Satara   45

In [24]:
# Get name and age of an employee from Sangli location

df[df.place=='Sangli'][['name','age']]

      name  age
2    Smita   25
7  Pallavi   25

In [25]:
# Add a column with designation

df['designation']=['developer','tester','designer','analyser','developer','developer','tester','designer','analyser','developer','tester']
df

         name     place  age designation
0      Ashwin      Pune   42   developer
1      Sanjay    Satara   20      tester
2       Smita    Sangli   25    designer
3     Vaibhav   Solapur   36    analyser
4    Abhijeet  Kolhapur   28   developer
5     Mahadev      Pune   24   developer
6     Supriya    Satara   45      tester
7     Pallavi    Sangli   25    designer
8      Sumeet   Solapur   21    analyser
9   Chidambar      Pune   19   developer
10    Subhash    Satara   45      tester

In [26]:
# Get duplicate entry: It will ignore first record and retrieve further records as duplicate records

df[df.duplicated('place')]

         name    place  age designation
5     Mahadev     Pune   24   developer
6     Supriya   Satara   45      tester
7     Pallavi   Sangli   25    designer
8      Sumeet  Solapur   21    analyser
9   Chidambar     Pune   19   developer
10    Subhash   Satara   45      tester

It can be possible like
df[df['place'].duplicated()]

In [27]:
# Get duplicate entry: It will ignore last record and retrieve previous records as duplicate records

df[df.duplicated('place',keep='last')]

      name    place  age designation
0   Ashwin     Pune   42   developer
1   Sanjay   Satara   20      tester
2    Smita   Sangli   25    designer
3  Vaibhav  Solapur   36    analyser
5  Mahadev     Pune   24   developer
6  Supriya   Satara   45      tester

In [28]:
# Drop duplicated records

df.drop_duplicates('place')

       name     place  age designation
0    Ashwin      Pune   42   developer
1    Sanjay    Satara   20      tester
2     Smita    Sangli   25    designer
3   Vaibhav   Solapur   36    analyser
4  Abhijeet  Kolhapur   28   developer

In [29]:
# Append new record

df=df.append({'name':'Meenal','place':'Kolhapur'},ignore_index=True)
df

         name     place   age designation
0      Ashwin      Pune  42.0   developer
1      Sanjay    Satara  20.0      tester
2       Smita    Sangli  25.0    designer
3     Vaibhav   Solapur  36.0    analyser
4    Abhijeet  Kolhapur  28.0   developer
5     Mahadev      Pune  24.0   developer
6     Supriya    Satara  45.0      tester
7     Pallavi    Sangli  25.0    designer
8      Sumeet   Solapur  21.0    analyser
9   Chidambar      Pune  19.0   developer
10    Subhash    Satara  45.0      tester
11     Meenal  Kolhapur   NaN         NaN

Here, only name and place values are provided. so values of remaining columns are missing and replaced by NaN

In [30]:
# Get count of missing values in each column

df.isna().sum()

name           0
place          0
age            1
designation    1
dtype: int64

It indicates that column age and designation having one missing value in each